In [1]:
import pandas as pd
import mysql.connector

In [3]:
#Connect to Database and Use datafellowshipIYKRA database

mydb = mysql.connector.connect(host='localhost', user='root', password='franklampard8')
cur = mydb.cursor()

def use_iykradatabase():
    cur.execute("USE datafellowshipIYKRA")
    
use_iykradatabase()

In [4]:
#Create sales table

def create_table():
    cur.execute("""CREATE TABLE sales 
                (id INT(100) AUTO_INCREMENT PRIMARY KEY, 
                Date DATETIME,
                Sales INT(10))""")
    
    cur.execute("DESCRIBE sales")
    
    return cur.fetchall()

create_table()

[('id', 'int(100)', 'NO', 'PRI', None, 'auto_increment'),
 ('Date', 'datetime', 'YES', '', None, ''),
 ('Sales', 'int(10)', 'YES', '', None, '')]

In [5]:
#Insert Values to Sales Table

def insert_value():
    sql = """INSERT INTO sales(date, sales)
             VALUES (%s,%s)"""
    val = [('2021-01-01', 100),
            ('2021-01-02', 34),
            ('2021-01-02', 123),
            ('2021-01-02', 134),
            ('2021-01-03', 145),
            ('2021-01-03', 24),
            ('2021-01-04', 541),
            ('2021-01-04', 636),
            ('2021-01-05', 322),
            ('2021-01-06', 242),
            ('2021-01-07', 22),
            ('2021-01-08', 46)]
    
    cur.executemany(sql, val)
    
    mydb.commit()
    
    print(cur.rowcount, "rows were inserted.")
    
insert_value()

12 rows were inserted.

In [6]:
#Calculate rolling sum using windows function

def rolling_sum():
    sql = """SELECT *, SUM(sales) OVER (PARTITION BY Date) rolling_sum
             FROM sales"""
    
    df = pd.read_sql_query(sql, mydb)
    
    return df

rolling_sum()

    id       Date  Sales  rolling_sum
0    1 2021-01-01    100        100.0
1    3 2021-01-02    123        291.0
2    4 2021-01-02    134        291.0
3    2 2021-01-02     34        291.0
4    5 2021-01-03    145        169.0
5    6 2021-01-03     24        169.0
6    7 2021-01-04    541       1177.0
7    8 2021-01-04    636       1177.0
8    9 2021-01-05    322        322.0
9   10 2021-01-06    242        242.0
10  11 2021-01-07     22         22.0
11  12 2021-01-08     46         46.0